/* Simplified Chinese Translation */

"\n\nAccessible Containers"="\n\n可访问的容器";
"\n\nAccessible Keychain Groups"="\n\n可访问的钥匙串组";
"\n\nCapabilities"="\n\n功能";
"\n\nDevice Info"="\n\n设备信息";
"\n\nPrivacy"="\n\n隐私";
"\n\nSandboxing"="\n\n沙盒";
"\nBundle Identifier: %@"="\n标识符: %@";
"\nSize: %@"="\n大小: %@";
"\nThe app can access protected information about this device:\n"="\n该应用可以访问此设备的受保护信息:\n";
"\nThe app can access the following services without asking for permission:\n"="\n该应用可以在不请求权限的情况下访问以下服务:\n";
"\nThe app can not spawn other binaries."="\n该应用无法生成其他二进制文件。";
"\nThe app can spawn arbitrary binaries as the mobile user."="\n该应用可以以 mobile 用户身份生成任意二进制文件。";
"\nThe app can spawn its own embedded binaries with root privileges."="\n该应用可以以 root 权限生成自己的嵌入式二进制文件。";
"\nThe app runs sandboxed and can only access the containers listed below."="\n该应用在沙盒环境下运行，并且只能访问下面列出的容器。";
"\nThe app runs unsandboxed and can access most of the file system."="\n该应用运行在非沙盒环境下，并可以访问大部分文件系统。";
"\nUnrestricted, the app can access all data containers on the system."="\n无限制，该应用可以访问系统上的所有数据容器。";
"\nUnrestricted, the app can access the entire keychain."="\n无限制，该应用可以访问整个钥匙串。";
"\nVersion: %@"="\n版本: %@";
"%@ %@\n\n© 2022-2024 Lars Fröder (opa334)\n\nTrollStore is NOT for piracy!\n\nCredits:\nGoogle TAG, @alfiecg_dev: CoreTrust bug\n@lunotech11, @SerenaKit, @tylinux, @TheRealClarity, @dhinakg, @khanhduytran0: Various contributions\n@ProcursusTeam: uicache, ldid\n@cstar_ow: uicache\n@saurik: ldid"="%@ %@\n\n© 2022-2026 Lars Fröder (opa334)\n\n巨魔（TrollStore ）拒绝盗版应用行为！\n\n🇨🇳 汉化源自 @sbwml & 🚗刀刀\n\n鸣谢:\nGoogle TAG, @alfiecg_dev: CoreTrust bug\n@lunotech11, @SerenaKit, @tylinux, @TheRealClarity, @dhinakg, @khanhduytran0: Various contributions\n@ProcursusTeam: uicache, ldid\n@cstar_ow: uicache\n@saurik: ldid";
"%@ %@\n\n© 2022-2026 Lars Fröder (opa334)\n\nTrollStore is NOT for piracy!\n\nCredits:\nGoogle TAG, @alfiecg_dev: CoreTrust bug\n@lunotech11, @SerenaKit, @tylinux, @TheRealClarity, @dhinakg, @khanhduytran0: Various contributions\n@ProcursusTeam: uicache, ldid\n@cstar_ow: uicache\n@saurik: ldid"="%@ %@\n\n© 2022-2026 Lars Fröder (opa334)\n\n巨魔（TrollStore ）拒绝盗版应用行为！\n\n🇨🇳 汉化源自 @sbwml & 🚗刀刀\n\n鸣谢:\nGoogle TAG, @alfiecg_dev: CoreTrust bug\n@lunotech11, @SerenaKit, @tylinux, @TheRealClarity, @dhinakg, @khanhduytran0: Various contributions\n@ProcursusTeam: uicache, ldid\n@cstar_ow: uicache\n@saurik: ldid";
"A non TrollStore or a Trollstore Lite app with the same identifier is already installed. If you are absolutely sure it is not, you can force install it."="已安装具有相同标识符的非 Trollstore 或 Trollstore Lite 应用程序。如果你确定它不是，请强制安装它。";
"Advanced"="高级";
"After rebooting, select \"Turn On\" to enable developer mode."="重新启动后，请选择“打开”以启用开发者模式。";
"Alfie"="Alfie";
"Alfie found the new CoreTrust bug (CVE-2023-41991) via patchdiffing, produced a POC binary and worked on automatically applying it with the help of the ChOma library, while also contributing to said library."="Alfie 发现了新的 CoreTrust 漏洞（CVE-2023-41991），通过 patchdiffing 生成了 POC 二进制文件，并借助 ChOma 库自动应用了该漏洞，同时也对该库进行了贡献。";
"Always (Recommended)"="始终（推荐）";
"Apps"="应用";
"Cancel"="取消";
"Close"="关闭";
"Confirm Uninstallation"="确认卸载";
"Continue"="继续";
"Copy Debug Log"="复制调试日志";
"Custom"="自定义";
"Default Configuration"="默认配置";
"Developer Mode"="开发者模式";
"Donate"="捐赠";
"Donate to alfiecg_dev"="捐赠给 alfiecg_dev";
"Donate to opa334"="捐赠给 opa334";
"Downloading"="下载中";
"Enable Developer Mode"="启用开发者模式";
"Error"="错误";
"Error %d"="错误 %d";
"Error downloading TrollStore: %@"="下载 TrollStore 出错：%@";
"Error downloading app: %@"="下载应用时出错: %@";
"Error downloading ldid: %@"="下载 ldid 时出错: %@";
"Error enabling JIT: trollstorehelper returned %d"="启用 JIT 出错：trollstorehelper 返回 %d";
"Error installing TrollStore: trollstorehelper returned %d"="安装 TrollStore 出错：trollstorehelper 返回了 %d";
"Failed to add app to icon cache."="将应用程序添加到图标缓存失败。";
"Failed to copy app bundle."="复制应用程序包失败。";
"Failed to create container for app bundle."="无法为应用程序包创建容器。";
"Failed to enable developer mode."="无法启用开发者模式。";
"Failed to extract IPA file."="提取 IPA 文件失败。";
"Failed to extract update tar file."="提取更新 tar 文件失败。";
"Failed to mark app as TrollStore app."="将应用程序标记为 TrollStore 应用程序失败。";
"Failed to open %@"="无法打开 %@";
"Failed to sign the app. The CoreTrust bypass returned a non zero status code."="应用程序签名失败。CoreTrust 绕过返回非零状态码。";
"Failed to sign the app. ldid returned a non zero status code."="应用程序签名失败，ldid 返回非零状态码。";
"Force Installation"="强制安装";
"Helper Installed as Standalone App"="持久性助手已作为独立应用安装";
"Helper Installed into %@"="持久性助手已安装到“%@”应用";
"If an app does not immediately appear after installation, respring here and it should appear afterwards."="若应用安装后未立即显示，请在此处执行注销设备或重建图标缓存，稍后即会出现。";
"In order for TrollStore to be able to install unsigned IPAs, ldid has to be installed using this button. It can't be directly included in TrollStore because of licensing issues."="为了 TrollStore 能够安装未签名的 IPA，必须使用此按钮安装 ldid。由于许可问题，它无法直接包含在 TrollStore 中。";
"In order to properly apply the change of the URL scheme setting, rebuilding the icon cache is needed."="为了正确应用 URL Scheme 设置的更改，您需要重建图标缓存。";
"Install"="安装";
"Install Error %d"="安装出错 %d";
"Install IPA File"="从 IPA 文件安装";
"Install Persistence Helper"="安装持久性助手";
"Install from URL"="从 URL 安装";
"Install ldid"="安装 ldid";
"Installation Method"="安装方式";
"Installation Method Segment"="安装方式段";
"Installing"="安装中";
"Installing TrollStore"="正在安装 TrollStore";
"Installing ldid"="安装 ldid";
"Metadata"="元数据";
"Never (Not Recommeded)"="从不（不推荐）";
"Only on Remote URL Installs"="仅限远程 URL 安装";
"Opa developed the ChOma library, helped with automating the bug using it and integrated it into TrollStore."="Opa 开发了 ChOma 库，帮助使用它自动化了漏洞，并将其集成到了 TrollStore 中。";
"Open"="打开";
"Open with JIT"="通过 JIT 打开";
"Parse Error %ld"="解析错误 %ld";
"Persistence"="持久性";
"Reboot Now"="立即重启";
"Reboot Required"="需要重启";
"Rebuild Icon Cache"="重建图标缓存";
"Rebuild Later"="稍后重建";
"Rebuild Now"="立即重建";
"Rebuilding Icon Cache"="重建图标缓存";
"Refresh App Registrations"="刷新应用注册";
"Refreshing"="刷新";
"Respring"="注销设备";
"Root View Controller"="根视图控制器";
"Security"="安全";
"Select App"="选择应用";
"Select a system app to install the TrollStore Persistence Helper into. The normal function of the app will not be available, so it is recommended to pick something useless like the Tips app."="选择要将持久性助手（TrollHelper）安装到的系统应用。应用程序的正常功能将不可用，因此建议选择一些无用的应用，如“提示”应用。";
"Settings"="设置";
"Show Details"="显示详情";
"Show Install Confirmation Alert"="显示安装确认弹窗";
"Signing"="签名";
"Some apps require developer mode enabled to launch. This requires a reboot to take effect."="某些应用程序需要启用开发者模式才能运行。这需要重新启动才能生效。";
"Switch to \"%@\" Registration"="切换到“%@”注册";
"Switch to \"User\""="切换到“用户”";
"Switched '%@' to \"System\" Registration"="将 '%@' 切换到“系统”注册";
"Switching '%@' to \"User\" Registration"="将 '%@' 切换到“用户”注册";
"Switching this app to a \"User\" registration will make it unlaunchable after the next respring because the bugs exploited in TrollStore only affect apps registered as \"System\".\nThe purpose of this option is to make the app temporarily show up in settings, so you can adjust the settings and then switch it back to a \"System\" registration (TrollStore installed apps do not show up in settings otherwise). Additionally, the \"User\" registration state is also useful to temporarily fix iTunes file sharing, which also doesn't work for TrollStore installed apps otherwise.\nWhen you're done making the changes you need and want the app to become launchable again, you will need to switch it back to \"System\" state in TrollStore."="将此应用切换到“用户”注册后，下次重新启动后将无法启动。这是因为 TrollStore 中利用的漏洞只影响“系统”注册的应用。\n此选项的目的是使应用暂时显示在设置中，以便您可以调整设置，然后再将其切换回“系统”注册（TrollStore 安装的应用在设置中不显示）。此外，“用户”注册状态还可用于临时修复 iTunes 文件共享，否则无法为 TrollStore 安装的应用工作。\n在完成所需更改并希望应用再次启动时，您需要在 TrollStore 中将其切换回 \"系统\" 状态。";
"System"="系统";
"The IPA file does not appear to contain an app."="IPA 文件似乎不包含应用程序。";
"The IPA file does not exist or is not accessible."="IPA 文件不存在或无法访问。";
"The URL Scheme, when enabled, will allow apps and websites to trigger TrollStore installations through the apple-magnifier:\/\/install?url=<IPA_URL> URL scheme and enable JIT through the apple-magnifier:\/\/enable-jit?bundle-id=<BUNDLE_ID> URL scheme."="启用 URL Scheme 后，应用程序和网站将通过 apple-magnifier:\/\/install?url=<IPA_URL> URL 方案触发 TrollStore 安装，并通过 apple-magnifier:\/\/enable-jit?bundle-id=<BUNDLE_ID> URL 方案启用 JIT。";
"The app does not contain an Info.plist file."="应用程序不包含 Info.plist 文件。";
"The app has been switched to the \"System\" registration state and will become launchable again after a respring."="应用已切换到“系统”注册状态，并将在重新启动后再次启动。";
"The app is not signed with a fake CoreTrust certificate and ldid is not installed. Install ldid in the settings tab and try again."="应用程序未使用虚假的 CoreTrust 证书签名，且未安装 ldid。在设置选项卡中安装 ldid，然后重试。";
"The app was installed successfully, but has additional binaries that are encrypted (e.g. extensions, plugins). The app itself should work, but you may experience broken functionality as a result."="应用程序已成功安装，但具有其他加密的二进制文件（例如扩展、插件）。应用程序本身应该可以正常工作，但可能会导致功能不完整。";
"The app was installed successfully, but requires developer mode to be enabled to run. After rebooting, select \"Turn On\" to enable developer mode."="应用程序已成功安装，但需要启用开发者模式才能运行。重新启动后，选择“打开”以启用开发者模式。";
"The app you tried to install has an encrypted main binary, which cannot have the CoreTrust bypass applied to it. Please ensure you install decrypted apps."="你尝试安装的应用程序具有加密的主二进制文件，无法应用 CoreTrust 绕过。请确保你安装的是解密后的应用程序。";
"The app you tried to install has the same identifier as a system app already installed on the device. The installation has been prevented to protect you from possible bootloops or other issues."="你尝试安装的应用程序与设备上已安装的系统应用程序具有相同的标识符。为了保护你免受可能的启动循环或其他问题的影响，安装已被阻止。";
"The app's Info.plist is missing required values."="应用程序的 Info.plist 缺少必需的值。";
"The app's main executable does not exist."="应用程序的主执行文件不存在。";
"This app was not able to launch because it has a \"User\" registration state, register it as \"System\" and try again."="无法打开此应用，因为其注册状态为“用户”，请将其注册为“系统”后重试。";
"URL Scheme Changed"="更改 URL Scheme";
"URL Scheme Enabled"="启用 URL Scheme";
"Unable to locate Info.plist inside app bundle."="无法在应用程序包中找到 Info.plist 文件。";
"Unable to locate app bundle inside the .IPA archive."="无法在 .IPA 存档中找到应用程序包。";
"Unable to locate main binary inside app bundle."="无法在应用程序包中找到主要二进制文件。";
"Uninstall"="卸载";
"Uninstall App"="卸载应用";
"Uninstall Persistence Helper"="卸载持久性助手";
"Uninstall TrollStore"="卸载 TrollStore";
"Uninstall TrollStore, Preserve Apps"="卸载 TrollStore，保留应用程序";
"Uninstall TrollStore, Uninstall Apps"="卸载 TrollStore，卸载应用程序";
"Uninstallation Method"="卸载方式";
"Uninstalling the app '%@' will delete the app and all data associated to it."="卸载应用“%@”将删除该应用及其关联的所有数据。";
"Uninstalling the persistence helper will revert this app back to it's original state, you will however no longer be able to persistently refresh the TrollStore app registrations. Continue?"="卸载持久性助手将会还原该应用程序到原始状态，您将不再能够持久地刷新 TrollStore 应用程序注册。是否继续？";
"Unknown Error"="未知错误";
"Update Available"="有更新可用";
"Update TrollStore to %@"="更新 TrollStore 到 %@";
"Update to %@"="更新到 %@";
"Updated TrollStore!"="已更新 TrollStore！";
"Updating TrollStore"="正在更新 TrollStore";
"Updating TrollStore..."="正在更新 TrollStore ...";
"User"="用户";
"Utilities"="工具";
"Warning"="警告";
"When iOS rebuilds the icon cache, all TrollStore apps including TrollStore itself will be reverted to \"User\" state and either disappear or no longer launch. If that happens, you can use the TrollHelper app on the home screen to refresh the app registrations, which will make them work again."="重建图标缓存时，TrollStore 及其应用会降级为“用户”注册，导致消失或失效。此时可通过主屏幕的持久性助手（TrollHelper）刷新注册信息使其恢复。";
"When iOS rebuilds the icon cache, all TrollStore apps including TrollStore itself will be reverted to \"User\" state and either disappear or no longer launch. If that happens, you can use the persistence helper installed into %@ to refresh the app registrations, which will make them work again."="当重建图标缓存时，所有 TrollStore 应用（含自身）将降级为“用户”注册并且消失或失效。请使用安装到 “%@” 中的持久性助手（TrollHelper）刷新应用注册，即可恢复运行。";
"When iOS rebuilds the icon cache, all TrollStore apps including TrollStore itself will be reverted to \"User\" state and either disappear or no longer launch. The only way to have persistence in a rootless environment is to replace a system application, here you can select a system app to replace with a persistence helper that can be used to refresh the registrations of all TrollStore related apps in case they disappear or no longer launch."="当重建图标缓存时，所有 TrollStore 应用（含自身）将降级为“用户”注册状态并消失或失效。在无Root环境中实现持久性的唯一方式是替换系统应用，请在此选择需替换的系统应用，将其替换为持久性助手（TrollHelper），该助手可刷新 TrollStore 相关应用权限注册以应对消失或失效情况。";
"You are about to uninstall TrollStore, do you want to preserve the apps installed by it?"="您将要卸载 TrollStore，是否要保留由其安装的应用程序？";
"installd"="安装器";
"installd (Recommended):\nUninstalls applications using the same API that SpringBoard uses when uninstalling them from the home screen.\n\nCustom:\nUninstalls applications by removing them from icon cache and then deleting their application and data bundles directly.\n\nNOTE: In cases where installd is selected but the stock uninstallation fails, TrollStore automatically falls back to using the Custom method."="安装器（推荐）:\n使用与 SpringBoard 在从主屏幕卸载应用程序时使用的相同 API 来卸载应用程序。\n\n自定义:\n通过从图标缓存中删除它们，然后直接删除其应用程序和数据包束来卸载应用程序。\n\n注意：在选择安装器但标准卸载失败的情况下，TrollStore 会自动回退到使用自定义方式。";
"installd:\nInstalls applications by doing a placeholder installation through installd, fixing the permissions and then adding it to icon cache.\nAdvantage: Might be slightly more persistent than the custom method in terms of icon cache reloads.\nDisadvantage: Causes some small issues with certain applications for seemingly no reason (E.g. Watusi cannot save preferences when being installed using this method).\n\nCustom (Recommended):\nInstalls applications by manually creating a bundle using MobileContainerManager, copying the app into it and adding it to icon cache.\nAdvantage: No known issues (As opposed to the Watusi issue outlined in the installd method).\nDisadvantage: Might be slightly less persistent then the installd method in terms of icon cache reloads.\n\nNOTE: In cases where installd is selected but the placeholder installation fails, TrollStore automatically falls back to using the Custom method."="安装器：\n通过在安装器中执行占位符安装、修复权限，然后将其添加到图标缓存中来安装应用程序。\n\n优点：在图标缓存重新加载方面可能比自定义方式稍微持久一些。\n\n缺点：出现某些应用程序的一些小问题，似乎没有原因（例如，使用此方式安装的 Watusi 无法保存偏好设置）。\n\n自定义（推荐）:\n通过手动创建一个 MobileContainerManager 包并将应用程序复制到其中，然后将其添加到图标缓存中来安装应用程序。\n\n优点：没有已知问题（相对于安装器方式中概述的 Watusi 问题）。\n\n缺点：在图标缓存重新加载方面可能比安装器方式稍微不持久。\n\n注意：在选择安装器但占位符安装失败的情况下，TrollStore 会自动回退到使用自定义方式。";
"ldid is installed and allows TrollStore to install unsigned IPA files."="ldid 已安装，允许 TrollStore 安装未签名的 IPA 文件。";
"ldid: Installed"="ldid：已安装";

"Context: User state in registration"="上下文：注册时的用户状态";
"Context: System state in registration"="上下文：注册时的系统状态";


// TrollStore Helper
"Powered by Fugu15 CoreTrust & installd bugs, thanks to @LinusHenze\n\n© 2022-2024 Lars Fröder (opa334)"="基于 Fugu15 CoreTrust，感谢 @LinusHenze。\n\n© 2022-2025 Lars Fröder (opa334)";
"Powered by CVE-2023-41991, originally discovered by Google TAG, rediscovered via patchdiffing by @alfiecg_dev\n\n© 2022-2024 Lars Fröder (opa334)"="基于漏洞 CVE-2023-41991，最初由 Google TAG 发现，由 @alfiecg_dev 通过 patchdiffing 重新生成。\n\n© 2022-2025 Lars Fröder (opa334)";
"Info"="信息";
"Install TrollStore"="安装 TrollStore";
"This app is registered as the TrollStore persistence helper and can be used to fix TrollStore app registrations in case they revert back to \"User\" state and the apps say they're unavailable."="该应用程序已注册为 TrollStore 持久性助手，可用于修复 TrollStore 应用程序注册，以防它们恢复到“用户”状态且应用程序显示不可用。";
"Unregister Persistence Helper"="取消注册持久性助手";
"If you want to use this app as the TrollStore persistence helper, you can register it here."="如果想使用此应用程序作为 TrollStore 持久性助手，可以在此处注册。";
"TrollStore Helper"="巨魔持久性助手";
"Not Installed"="未安装";
"Installed, %@"="已安装, %@";

"Apps will be registered as User by default since AppSync Unified is installed.\n\n"="由于安装了 AppSync Unified，应用程序将默认注册为用户。\n\n";
"Apps will be registered as System by default since AppSync Unified is not installed. When apps loose their System registration and stop working, press \"Refresh App Registrations\" here to fix them.\n\n"="由于未安装 AppSync Unified，因此应用程序将默认注册为系统。当应用程序丢失系统注册并停止工作时，请点击此处的“刷新应用程序注册”以修复它们。\n\n";
"Transfer Apps"="转移应用";
"Transfering"="转移中";
"Transfer"="转移";
"Transfer Failed"="转移失败";
"Failed to transfer %zu %@"="%zu %@ 转移失败";
"App"="应用";
"apps"="应用";
"app"="应用";
"URL"="URL";
"\n\nURL Schemes"="\n\nURL Scheme";
"This option will transfer %zu apps from Trollstore Lite to TrollStore. Continue?"="此选项将 %zu 个应用从 Trollstore Lite 转移到 TrollStore。是否继续？";
"Transfer %zu %@"="转移 %zu 个 %@";
